* Moss imitation


#+BEGIN_SRC ipython :exports both :session :results raw drawer
  from node_diffusion import *
  import matplotlib.pyplot as plt
  %matplotlib inline

  sns.set()
  t1 = time.time()
  # Number of time points, in seconds
  nt = 60*20
  # delta t is just one
  dt = 1
  # Number of cells per direction
  Xs, Ys = 2001, 1 # has to be odd because reasons
  # Using moss cell measurements
  cell_um = 100
  dx2 = cell_um**2
  # Chem radius in meters
  q = 1e-10 # This param of q needs some work
  r = 3.5e-10
  # Speed in micrometers
  D = D_eff(stokes_einstein(r) * 1e+12, q, cell_um)

  # Set IC and add pulse in centre
  ic = np.zeros((Ys, Xs))
  ic[Ys//2, Xs//2] = 1
  # Make nodes from IC
  nodes = array_to_nodes(ic)
  # some cell and PD constants
  pd_rate = 1
  beta = .001
  prod_upper_lim = 0.6
  prod_lower_lim = 0.1
  # Get results from cells
  Cells = [deepcopy(nodes)] + [deepcopy(do_node_diffusion(nodes, dx2, D, i, pd_rate, beta))
                               for i in range(1, nt)]
  vals = [nodes_to_array(i).sum() for i in Cells]
  use = np.linspace(0, nt-1, num=4, dtype=int)
  t2 = time.time()

  'Took: {0}s'.format(t2-t1)
#+END_SRC

#+RESULTS:
:RESULTS:
# Out[112]:
: 'Took: 34.245070934295654s'
:END:



